; domain
(define (domain joint_teleport-assistance6_domain)
(:requirements :typing :action-costs)

(:types
    place telstatus - object
)

(:constants
    origin destination disabled - telstatus
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (at-prime ?p -  place)
    (at-teleport ?p - place ?s -  telstatus)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (adj-walk ?p1 - place ?p2 -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_activate-teleport-origin
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_origin_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos origin)
        (not (teleport_origin_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_activate-teleport-destination
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_destination_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos destination)
        (not (teleport_destination_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_use-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (at-prime ?pos1)
        (at-teleport ?pos1 origin)
        (at-teleport ?pos2 destination)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-prime ?pos2)
        (not (at-prime ?pos1))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_teleport-assistance6_problem_104)
(:domain joint_teleport-assistance6_domain)
(:objects
    pos0-1 pos1-0 pos1-1 pos1-3 pos4-4 pos5-0 pos6-0 pos7-0 pos7-1 pos7-2 pos7-3 pos8-0 pos8-1 pos8-3 pos8-4 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (at-teleport pos8-1 disabled)
    (at-teleport pos0-1 disabled)
    (at-teleport pos1-0 disabled)
    (at-teleport pos6-0 disabled)
    (at-teleport pos1-1 disabled)
    (at-teleport pos7-3 disabled)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (at-prime pos8-4)
    (adj-walk pos0-1 pos1-1)
    (adj-walk pos1-1 pos0-1)
    (adj-walk pos1-0 pos1-1)
    (adj-walk pos1-1 pos1-0)
    (adj-walk pos5-0 pos6-0)
    (adj-walk pos6-0 pos5-0)
    (adj-walk pos6-0 pos7-0)
    (adj-walk pos7-0 pos6-0)
    (adj-walk pos7-0 pos7-1)
    (adj-walk pos7-1 pos7-0)
    (adj-walk pos7-0 pos8-0)
    (adj-walk pos8-0 pos7-0)
    (adj-walk pos7-1 pos7-2)
    (adj-walk pos7-2 pos7-1)
    (adj-walk pos7-1 pos8-1)
    (adj-walk pos8-1 pos7-1)
    (adj-walk pos7-2 pos7-3)
    (adj-walk pos7-3 pos7-2)
    (adj-walk pos7-3 pos8-3)
    (adj-walk pos8-3 pos7-3)
    (adj-walk pos8-0 pos8-1)
    (adj-walk pos8-1 pos8-0)
    (adj-walk pos8-3 pos8-4)
    (adj-walk pos8-4 pos8-3)
)

(:goal
  (and
    (at-prime pos7-0)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_activate-teleport-destination pos6-0)
   deleted: (supporter_turn) (teleport_destination_can_be_activated) (at-teleport pos6-0 disabled)
   added: (prime_turn) (at-teleport pos6-0 destination)
   goals met: 0 of 1
2. (pri_walk pos8-4 pos8-3)
   deleted: (prime_turn) (at-prime pos8-4)
   added: (supporter_turn) (at-prime pos8-3)
   goals met: 0 of 1
3. (sup_activate-teleport-origin pos7-3)
   deleted: (supporter_turn) (teleport_origin_can_be_activated) (at-teleport pos7-3 disabled)
   added: (prime_turn) (at-teleport pos7-3 origin)
   goals met: 0 of 1
4. (pri_walk pos8-3 pos7-3)
   deleted: (prime_turn) (at-prime pos8-3)
   added: (supporter_turn) (at-prime pos7-3)
   goals met: 0 of 1
5. (sup_use-teleport pos7-3 pos6-0)
   deleted: (supporter_turn) (at-prime pos7-3)
   added: (prime_turn) (at-prime pos6-0)
   goals met: 0 of 1
6. (pri_walk pos6-0 pos7-0)
   deleted: (prime_turn) (at-prime pos6-0)
   added: (supporter_turn) (at-prime pos7-0)
   goals met: 1 of 1
